
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.et-ai-connection-string
  * azurerm_key_vault_secret.et-ai-instrumentation-key
  * module.application_insights.azurerm_application_insights.this
* Update
  * module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.storage-account.azurerm_storage_account.storage_account
* Delete
  * module.storage-account.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Delegator&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.et-ai-connection-string will be created
  + resource "azurerm_key_vault_secret" "et-ai-connection-string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.KeyVault/vaults/et-pet-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.et-ai-instrumentation-key will be created
  + resource "azurerm_key_vault_secret" "et-ai-instrumentation-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.KeyVault/vaults/et-pet-aat"
      + name                    = "app-insights-instrumentation-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "et-pet-aat"
      + resource_group_name                   = "et-pet-aat"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "et-pet"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pet"
          + "environment"         = "staging"
          + "managedBy"           = "Employment Tribunals PET"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
    }

  # module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.KeyVault/vaults/et-pet-aat|et-pet-aat"
        name                           = "et-pet-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage-account.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Delegator"] will be destroyed
  # (because key ["Storage Blob Delegator"] is not in for_each map)
  - resource "azurerm_role_assignment" "storage-account-role-assignment" {
      - id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.Storage/storageAccounts/etpetsaaat/providers/Microsoft.Authorization/roleAssignments/adedd278-6d33-7ac5-9244-9cd11397d7fd" -> null
      - name                 = "adedd278-6d33-7ac5-9244-9cd11397d7fd" -> null
      - principal_id         = "d0c32eaa-f190-4b8e-9884-adefce62b143" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a" -> null
      - role_definition_name = "Storage Blob Delegator" -> null
      - scope                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.Storage/storageAccounts/etpetsaaat" -> null
    }

  # module.storage-account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.Storage/storageAccounts/etpetsaaat"
        name                              = "etpetsaaat"
        tags                              = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "81.103.190.218",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":6,"Program":"tfcmt","SHA1":"","Vars":{}} -->